// Chen-数据存放处理
export default {
  BottomLeft1Config: {
    data: [
      {
        name: "深圳xx科技有限公司",
        value: "255万",
      },
      {
        name: "深圳生物医药科技有限公司",
        value: "120万",
      },
      {
        name: "深圳科技数据有限公司",
        value: "78万",
      },
      {
        name: "中建集团安装工程有限公司",
        value: "66万",
      },
      {
        name: "江苏资产管理经营有限公司",
        value: "40万",
      },
      {
        name: "佛山市有机硅有限公司",
        value: "20万",
      },
    ],
    rowNum: 6,
  },
  BottomLeft2Config: {
    data: [
      {
        name: "xx托管有限公司",
        value: "65万",
      },
      {
        name: "奥xx保健品",
        value: "59万",
      },
      {
        name: "佛山xx集团变压器有限公司",
        value: "48万",
      },
      {
        name: "中建xx集团安装工程有限公司",
        value: "36万",
      },
      {
        name: "江苏xx资产管理经营有限公司",
        value: "10万",
      },
      {
        name: "佛山市顺德区xx瓦克有机硅有限公司分公司",
        value: "2万",
      },
    ],
    rowNum: 6,
  },
  BottomRight2Config: {
    header: ["日期", "故障类型", "故障描述", "处理方法"],
    data: [
      ["2024-07-01", "效果问题", "打印模糊", "激光器故障明天处理"],
      ["2024-07-02", "卡纸", "无论打什么颜色都是花的", "更换黑色硒鼓"],
      [
        "2024-07-03",
        "出故障代码 ,开机没反应",
        "打印出的纸张有黑点、重影",
        "添加115克黄色载体，更换红色3600搓纸轮",
      ],
      [
        "2024-07-04",
        "效果问题",
        "路基危害-防尘网",
        "电源线坏了，更换了纸盒搓纸轮",
      ],
      [
        "2024-07-05",
        "效果问题,打印纸张不清楚",
        "黄色显影缺载体",
        "xxxxxxx",
      ],
      [
        "2024-07-06",
        "卡纸,出故障代码",
        "经常复印卡纸",
        "更换黑色鼓组淘宝的",
      ],
      [
        "2024-07-07",
        "声音问题",
        "打印有线",
        "硒鼓寿命到期，2024年12.31。已经屏蔽提示。",
      ],
      [
        "2024-07-08",
        "开机没反应",
        "更换转印带",
        "定影上辊及轴套老化需要订备件更换",
      ],
      ["2024-07-09", "效果问题", "打印偶尔底灰线条", "更换DR215黑色"],
      [
        "2024-07-10",
        "效果问题",
        "输稿器卡纸报错66-03 ,解决是去发现纸张带静",
        "进维修模式打代码清除报错",
      ],
      [
        "2024-07-08",
        "开机没反应",
        "更换转印带",
        "定影上辊及轴套老化需要订备件更换",
      ],
      ["2024-07-09", "效果问题", "打印偶尔底灰线条", "更换DR215黑色"],
      [
        "2024-07-10",
        "效果问题",
        "输稿器卡纸报错66-03 ,解决是去发现纸张带静",
        "进维修模式打代码清除报错",
      ],
      [
        "2024-07-08",
        "开机没反应",
        "更换转印带",
        "定影上辊及轴套老化需要订备件更换",
      ],
      ["2024-07-09", "效果问题", "打印偶尔底灰线条", "更换DR215黑色"],
      [
        "2024-07-10",
        "效果问题",
        "输稿器卡纸报错66-03 ,解决是去发现纸张带静",
        "进维修模式打代码清除报错",
      ],
    ],
    index: true,
    columnWidth: [50, 95, 120, 240, 200],
    align: ["center"],
    rowNum: 10,
    headerHeight: 45,
    headerBGC: "rgba(9, 37, 50, 0.4)",
    oddRowBGC: "rgba(9, 37, 50, 0.4)",
    evenRowBGC: "rgba(10, 32, 50, 0.3)",
  }
}